In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/05/4b/cade88002bce6a808c44199617160bd9d78c23d4bb91950f4397aebf063f/pandas-1.5.0-cp38-cp38-macosx_10_9_x86_64.whl (11.9MB)
    100% |████████████████████████████████| 11.9MB 4.6MB/s eta 0:00:01
Collecting pytz>=2020.1 (from pandas)
  Using cached https://files.pythonhosted.org/packages/d5/50/54451e88e3da4616286029a3a17fc377de817f66a0f50e1faaee90161724/pytz-2022.2.1-py2.py3-none-any.whl
Requirement already satisfied: numpy>=1.20.3; python_version < "3.10" in ./venv/lib/python3.8/site-packages (from pandas) (1.23.3)
Requirement already satisfied: python-dateutil>=2.8.1 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.5.0 pytz-2022.2.1

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [4]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [5]:
df.loc[0] = ["Allen", "22", "175"]

In [6]:
df

    Name Age Height
0  Allen  22    175

In [7]:
df.loc[1] = ["Ted", "25", "180"]
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [8]:
df["Height"]

0    175
1    180
Name: Height, dtype: object

In [9]:
df["Weight"] = [75, 80]

In [10]:
df

    Name Age Height  Weight
0  Allen  22    175      75
1    Ted  25    180      80

In [11]:
df["Weight"]

0    75
1    80
Name: Weight, dtype: int64

In [13]:
df.drop(["Weight"], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [14]:
df

    Name Age Height  Weight
0  Allen  22    175      75
1    Ted  25    180      80

In [15]:
df = df.drop(["Weight"], axis=1)

In [16]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180